In [1]:
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 40, 45],
    'Score': [85, 92, 78, 88, 95]
}
df = pd.DataFrame(data)
print("\nSample DataFrame:")
print(df)

df.to_csv('sample_data.csv', index=False)


print("\nLoading CSV file:")
csv_data = pd.read_csv('sample_data.csv')

print("\nFirst 3 rows (head):")
print(csv_data.head(3))  

print("\nDescriptive statistics:")
print(csv_data.describe())  

print("\nColumn info:")
print(csv_data.info())  

print("\nScores above 85:")
print(csv_data[csv_data['Score'] > 85])

Sample DataFrame:
      Name  Age  Score
0    Alice   25     85
1      Bob   30     92
2  Charlie   35     78
3    David   40     88
4      Eve   45     95

Loading CSV file:

First 3 rows (head):
      Name  Age  Score
0    Alice   25     85
1      Bob   30     92
2  Charlie   35     78

Descriptive statistics:
             Age      Score
count   5.000000   5.000000
mean   35.000000  87.600000
std     7.905694   6.580274
min    25.000000  78.000000
25%    30.000000  85.000000
50%    35.000000  88.000000
75%    40.000000  92.000000
max    45.000000  95.000000

Column info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Score   5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes
None

Scores above 85:
    Name  Age  Score
1    Bob   30     92
3  David   40     88
4    Eve   45     95

In [2]:
import pandas as pd

In [3]:
titanic = pd.read_csv('https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv')

In [4]:
print("first 5 rows:")

first 5 rows:

In [5]:
print(titanic.head())

   Survived  Pclass                                               Name  \
0         0       3                             Mr. Owen Harris Braund
1         1       1  Mrs. John Bradley (Florence Briggs Thayer) Cum...
2         1       3                              Miss. Laina Heikkinen
3         1       1        Mrs. Jacques Heath (Lily May Peel) Futrelle
4         0       3                            Mr. William Henry Allen

      Sex   Age  Siblings/Spouses Aboard  Parents/Children Aboard     Fare
0    male  22.0                        1                        0   7.2500
1  female  38.0                        1                        0  71.2833
2  female  26.0                        0                        0   7.9250
3  female  35.0                        1                        0  53.1000
4    male  35.0                        0                        0   8.0500

In [6]:
titanic.describe()

,Survived,Pclass,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
count,887.000000,887.000000,887.000000,887.000000,887.000000,887.00000
mean,0.385569,2.305524,29.471443,0.525366,0.383315,32.30542
std,0.487004,0.836662,14.121908,1.104669,0.807466,49.78204
min,0.000000,1.000000,0.420000,0.000000,0.000000,0.00000
25%,0.000000,2.000000,20.250000,0.000000,0.000000,7.92500
50%,0.000000,3.000000,28.000000,0.000000,0.000000,14.45420
75%,1.000000,3.000000,38.000000,1.000000,0.000000,31.13750
max,1.000000,3.000000,80.000000,8.000000,6.000000,512.32920

In [7]:
titanic.tail()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
882,0,2,Rev. Juozas Montvila,male,27.0,0,0,13.00
883,1,1,Miss. Margaret Edith Graham,female,19.0,0,0,30.00
884,0,3,Miss. Catherine Helen Johnston,female,7.0,1,2,23.45
885,1,1,Mr. Karl Howell Behr,male,26.0,0,0,30.00
886,0,3,Mr. Patrick Dooley,male,32.0,0,0,7.75

In [8]:
print("dataset information:")
print(titanic.info())

dataset information:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 887 non-null    int64
 1   Pclass                   887 non-null    int64
 2   Name                     887 non-null    object
 3   Sex                      887 non-null    object
 4   Age                      887 non-null    float64
 5   Siblings/Spouses Aboard  887 non-null    int64
 6   Parents/Children Aboard  887 non-null    int64
 7   Fare                     887 non-null    float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.6+ KB
None

In [22]:
print("\nSurvival counts:")
print(titanic['Survived'].value_counts())

Survival counts:
Survived
0    545
1    342
Name: count, dtype: int64

In [26]:
print("class distribution:")
print(titanic['Pclass'].value_counts())# value_counts() are basically used for categorial data analysis

class distribution:
Pclass
3    487
1    216
2    184
Name: count, dtype: int64

In [30]:
print("gender distribution:")
print(titanic['Sex'].value_counts())

gender distribution:
Sex
male      573
female    314
Name: count, dtype: int64

In [32]:
print("survival rate by class")
print(titanic.groupby('Pclass')['Survived'].mean())

survival rate by class
Pclass
1    0.629630
2    0.472826
3    0.244353
Name: Survived, dtype: float64

In [34]:
print("average age of survival status")
print(titanic.groupby('Age')['Survived'].mean()) # .groupby is basically used for aggregated analysis

average age of survival status
Age
0.42     1.0
0.67     1.0
0.75     1.0
0.83     1.0
0.92     1.0
        ...
70.00    0.0
70.50    0.0
71.00    0.0
74.00    0.0
80.00    1.0
Name: Survived, Length: 89, dtype: float64

In [36]:
print("missing values per column")
print(titanic.isnull().sum)

missing values per column
<bound method DataFrame.sum of      Survived  Pclass   Name    Sex    Age  Siblings/Spouses Aboard  \
0       False   False  False  False  False                    False
1       False   False  False  False  False                    False
2       False   False  False  False  False                    False
3       False   False  False  False  False                    False
4       False   False  False  False  False                    False
..        ...     ...    ...    ...    ...                      ...
882     False   False  False  False  False                    False
883     False   False  False  False  False                    False
884     False   False  False  False  False                    False
885     False   False  False  False  False                    False
886     False   False  False  False  False                    False

     Parents/Children Aboard   Fare
0                      False  False
1                      False  False
2                      False  False
3                      False  False
4                      False  False
..                       ...    ...
882                    False  False
883                    False  False
884                    False  False
885                    False  False
886                    False  False

[887 rows x 8 columns]>

In [38]:
titanic_dropped = titanic.dropna(subset=['Age'])
print(f"\nShape after dropping missing ages: {titanic_dropped.shape}")

Shape after dropping missing ages: (887, 8)

In [40]:
titanic_filled = titanic.copy()
titanic_filled['Age'] = titanic_filled['Age'].fillna(titanic_filled['Age'].median())
print("Missing values after filling:")
print(titanic_filled['Age'].isnull().sum())

Missing values after filling:
0

In [42]:
first_class = titanic[titanic['Pclass'] == 1]
print(f"\nFirst class passengers count: {len(first_class)}")
young_survivors = titanic[(titanic['Age'] < 18) & (titanic['Survived'] == 1)]
print(f"Young survivors count: {len(young_survivors)}")
subset = titanic[['Name', 'Age', 'Survived']]
print("\nSelected columns sample:")
print(subset.head())

First class passengers count: 216
Young survivors count: 65

Selected columns sample:
                                                Name   Age  Survived
0                             Mr. Owen Harris Braund  22.0         0
1  Mrs. John Bradley (Florence Briggs Thayer) Cum...  38.0         1
2                              Miss. Laina Heikkinen  26.0         1
3        Mrs. Jacques Heath (Lily May Peel) Futrelle  35.0         1
4                            Mr. William Henry Allen  35.0         0

In [46]:
women_children = titanic[(titanic['Sex'] == 'female') | (titanic['Age'] < 18)]
survival_rate = women_children['Survived'].mean()
print(f"\nSurvival rate for women and children: {survival_rate:.2%}")
expensive_tickets = titanic.sort_values('Fare', ascending=False).head(10)
print("\nMost expensive tickets:")
print(expensive_tickets[['Name', 'Pclass', 'Fare']])

Survival rate for women and children: 67.72%

Most expensive tickets:
                                  Name  Pclass      Fare
676  Mr. Thomas Drake Martinez Cardeza       1  512.3292
257                    Miss. Anna Ward       1  512.3292
733              Mr. Gustave J Lesurer       1  512.3292
87           Miss. Mabel Helen Fortune       1  263.0000
435                   Mr. Mark Fortune       1  263.0000
339      Miss. Alice Elizabeth Fortune       1  263.0000
27       Mr. Charles Alexander Fortune       1  263.0000
738         Miss. Susan Parker Ryerson       1  262.3750
309          Miss. Emily Borie Ryerson       1  262.3750
117            Mr. Quigg Edmond Baxter       1  247.5208

In [58]:
print(titanic.shape)

(887, 8)